{
  "profile": {
    "name": "Siddhivinayak Sector",
    "email": "shubhamkhilari6@gmail.com",
    "phone": "+91 9321047112 ",
    "location": "Mumbai",
    "links": []
  },
  "education": [
    {
      "institution": "Fr. Conceicao Rodrigues Institute Of Technology May 2027 Bachelor of Technology Related Coursework: Database Systems, Computer Science, Operations Management, Computer Networks, Software Engineering,Data Structures. CGPA:8.97/10 (current)",
      "degree": "",
      "field": "",
      "dates": null,
      "score": "CGPA: 8.97"
    }
  ],
  "experience": [
    {
      "header": "through real-world projects, contribute to impactful solutions, and develop into a confident and skilled software developer.",
      "bullets": []
    },
    {
      "header": "Computer Engineering Department, Fr.CRIT Dec 2025 - Present Full Stack Intern I am working as a Full Stack Intern on the “Comprehensive Placement Information System for the Computer Engineering Department, where I conceptualize and build an integrated portal for students, alumni, and administrators. I develop responsive frontend interfaces, implement backend logic with role-based authentication and database management, centralize placement records and departmental data, and learn end-to-end full stack development while ensuring the system is secure, scalable, and user-friendly.",
      "bullets": []
    }
  ],
  "projects": [
    {
      "title": "YuvaSetu - AI-Powered Internship Platform | Smart India Hackathon 2025 Dec 2025 (1st Runner-Up) Developed a full-stack multi-portal internship platform as part of a 6-member team, architecting separate React +TypeScript + Vite frontends for students, employers, and administrators, backed by dual Python FastAPI microservices.",
      "bullets": [
        "Implemented AI-powered semantic search using FAISS vector embeddings for intelligent internship-candidate matching, integrated Firebase authentication and MongoDB for data persistence, and containerized the entire application using Docker.",
        "Built RESTful APIs with role-based access control, Redis caching for performance optimization, and configured Nginx reverse proxy for seamless multi-service deployment across the monorepo architecture."
      ]
    }
  ],
  "skills": {
    "languages": [
      "python",
      "java",
      "javascript"
    ],
    "frameworks": [
      "react"
    ],
    "databases": [
      "mysql",
      "mongodb"
    ],
    "cloud_devops": [
      "docker",
      "kubernetes"
    ],
    "concepts": [
      "ml",
      "os"
    ]
  },
  "certifications": [],
  "other": [],
  "signals": {
    "phrases": [
      "Conceicao Rodrigues Institute Of Technology",
      "Technology Related Coursework",
      "Database Systems",
      "Fr. Conceicao Rodrigues Institute",
      "Technology May 2027 Bachelor",
      "Technology Related Coursework: Database Systems",
      "Computer Science",
      "Operations Management",
      "Computer Networks",
      "Software Engineering",
      "Data Structures",
      "Data Structures. CGPA:8.97",
      "through real-world projects",
      "impactful solutions",
      "develop into",
      "skilled software developer.",
      "Computer Engineering Department",
      "Present Full Stack Intern",
      "Full Stack Intern",
      "Comprehensive Placement Information System",
      "Fr.CRIT Dec 2025",
      "am working as",
      "Placement Information System",
      "the Computer Engineering Department",
      "build an integrated portal",
      "develop responsive frontend interfaces",
      "implement backend logic",
      "role-based authentication",
      "database management",
      "centralize placement records",
      "departmental data",
      "learn end-to-end full stack development while ensuring the system is secure",
      "Powered Internship Platform",
      "AI-Powered Internship Platform",
      "Smart India Hackathon",
      "Smart India Hackathon 2025 Dec 2025",
      "1st Runner-Up",
      "full-stack multi-portal internship platform as part",
      "6-member team",
      "architecting separate React",
      "Vite frontends",
      "dual Python FastAPI microservices.",
      "Implemented AI-powered semantic search",
      "FAISS vector embeddings",
      "intelligent internship-candidate matching",
      "integrated Firebase authentication",
      "data persistence",
      "containerized the entire application",
      "Built RESTful APIs",
      "role-based access control",
      "Redis caching",
      "performance optimization",
      "configured Nginx reverse proxy",
      "seamless multi-service deployment across the monorepo architecture.",
      "Frontend: HTML5",
      "building responsive",
      "component-based web applications Programming",
      "Databases: Python",
      "backend logic",
      "data management DevOps",
      "Tools: GitHub",
      "version control",
      "basic container orchestration",
      "Foundations Associate",
      "Certification: AI Foundations Associate from Oracle",
      "Certified Professional",
      "Operating System",
      "Operating System: Windows",
      "Mac OS",
      "Language: English"
    ],
    "full_text": "Fr. Conceicao Rodrigues Institute Of Technology May 2027 Bachelor of Technology Related Coursework: Database Systems, Computer Science, Operations Management, Computer Networks, Software Engineering,Data Structures. CGPA:8.97/10 (current) through real-world projects, contribute to impactful solutions, and develop into a confident and skilled software developer. Computer Engineering Department, Fr.CRIT Dec 2025 - Present Full Stack Intern I am working as a Full Stack Intern on the “Comprehensive Placement Information System for the Computer Engineering Department, where I conceptualize and build an integrated portal for students, alumni, and administrators. I develop responsive frontend interfaces, implement backend logic with role-based authentication and database management, centralize placement records and departmental data, and learn end-to-end full stack development while ensuring the system is secure, scalable, and user-friendly. YuvaSetu - AI-Powered Internship Platform | Smart India Hackathon 2025 Dec 2025 (1st Runner-Up) Developed a full-stack multi-portal internship platform as part of a 6-member team, architecting separate React +TypeScript + Vite frontends for students, employers, and administrators, backed by dual Python FastAPI microservices. Implemented AI-powered semantic search using FAISS vector embeddings for intelligent internship-candidate matching, integrated Firebase authentication and MongoDB for data persistence, and containerized the entire application using Docker. Built RESTful APIs with role-based access control, Redis caching for performance optimization, and configured Nginx reverse proxy for seamless multi-service deployment across the monorepo architecture. Frontend: HTML5, CSS, JavaScript, and React for building responsive, interactive, and component-based web applications Programming & Databases: Python, C, Java with MySQL (Intermediate), MongoDB (Learning), and Neo4j (Learning) for backend logic and data management DevOps & Tools: GitHub for version control, Docker for containerization, and Kubernetes for basic container orchestration Certification: AI Foundations Associate from Oracle, Certified Professional of Neo4J. Operating System: Windows, Mac OS and Linux. Language: English,Hindi,Marathi."
  }
}